Taylor_Green_vortex/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myfireFoamFast;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         10.01;

deltaT          0.003;

writeControl    adjustableRunTime;

writeInterval   10.0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.01;

functions
{
    k_sgs
    {
        type               cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        outputControl      runTime; //outputTime;
        writeInterval      0.001;
        log                false;     
        valueOutput        false;
        source             all;       //cellZone;
        sourceName         c0;
        operation          volAverage;
        fields
        (
            k
        );
    }

    k_res
    {
        type               cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        outputControl      runTime; //outputTime;
        writeInterval      0.001;
        log                false;     
        valueOutput        false;
        source             all;       //cellZone;
        sourceName         c0;
        operation          volAverage;
        fields
        (
            k_res
        );
    }

    enstrophy
    {
        type               cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled            true;
        outputControl      runTime; //outputTime;
        writeInterval      0.001;
        log                false;     
        valueOutput        false;
        source             all;       //cellZone;
        sourceName         c0;
        operation          volAverage;
        fields
        (
            enstrophy
        );
    }

    fieldAverage
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        timeStart       0.01;
        timeEnd         1.0;
        outputControl   outputTime;
        fields
        (
            k
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}

// ************************************************************************* //
